АлогистикТест2/src/Documents/алк_ВыгрузкаИзКамерыПропарки/алк_ВыгрузкаИзКамерыПропарки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ВыгрузкаИзКамерыПропарки</name>
  <basedOn>Document.алк_ЗагрузкаВКамеруПропарки</basedOn>
  <registerRecords>AccumulationRegister.алк_УчетВремениПропарки</registerRecords>
  <registerRecords>InformationRegister.алк_СтатусПропарки</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиВКамерахПропарки</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Бригада</name>
    <type>
      <types>CatalogRef.алк_СменыШпон</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>КамераПропарки</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОстановкиКамеры</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоВыгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеВыгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НормативЗагрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сезон</name>
    <type>
      <types>EnumRef.алк_СезоныПропарки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.алк_ЗагрузкаВКамеруПропарки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдётРазгрузка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСмены</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Порода</name>
      <type>
        <types>CatalogRef.Породы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сорт</name>
      <type>
        <types>CatalogRef.Сорта</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрадацияПропарки</name>
      <type>
        <types>CatalogRef.алк_ГрадацияПропарки</types>
      </type>
    </attributes>
    <attributes>
      <name>НормативноеВремяПропарки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/InformationRegisters/алк_ПериодыСезоновПропарки/алк_ПериодыСезоновПропарки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПериодыСезоновПропарки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Сезон</name>
    <type>
      <types>EnumRef.алк_СезоныПропарки</types>
    </type>
  </resources>
</mdclass:InformationRegister>

АлогистикТест2/src/InformationRegisters/алк_НормативыПропарки/алк_НормативыПропарки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_НормативыПропарки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>НормативПропарки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормативЗагрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Градация</name>
    <type>
      <types>CatalogRef.алк_ГрадацияПропарки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Порода</name>
    <type>
      <types>CatalogRef.Породы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сезон</name>
    <type>
      <types>EnumRef.алк_СезоныПропарки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Enums/алк_СезоныПропарки/алк_СезоныПропарки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_СезоныПропарки</name>
  <enumValues>
    <name>Лето</name>
  </enumValues>
  <enumValues>
    <name>Зима</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Enums/Смены/Смены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Смены</name>
  <enumValues>
    <name>смена_8_20</name>
  </enumValues>
  <enumValues>
    <name>смена_20_8</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Documents/алк_ЗагрузкаВКамеруПропарки/алк_ЗагрузкаВКамеруПропарки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ЗагрузкаВКамеруПропарки</name>
  <registerRecords>AccumulationRegister.алк_УчетВремениПропарки</registerRecords>
  <registerRecords>InformationRegister.алк_СтатусПропарки</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиВКамерахПропарки</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Бригада</name>
    <type>
      <types>CatalogRef.алк_СменыШпон</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>КамераПропарки</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоЗагрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеЗагрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЗапускаКамеры</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НормативЗагрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормативПропарки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сезон</name>
    <type>
      <types>EnumRef.алк_СезоныПропарки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдётЗагрузка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСмены</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Порода</name>
      <type>
        <types>CatalogRef.Породы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сорт</name>
      <type>
        <types>CatalogRef.Сорта</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрадацияПропарки</name>
      <type>
        <types>CatalogRef.алк_ГрадацияПропарки</types>
      </type>
    </attributes>
    <attributes>
      <name>НормативноеВремяПропарки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Documents/алк_ВыгрузкаИзКамерыПропарки/Forms/ФормаДокумента/Module.bsl
// кнопки времени 

&НаКлиенте
Процедура НачалоВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
	ВызовФормыВремени(Объект.НачалоВыгрузки, "НачалоВыгрузки");	
КонецПроцедуры  
&НаКлиенте
Процедура НачалоВыгрузкиПриИзменении(Элемент)
	ПараметрыВремени = Новый Структура;
	ПараметрыВремени.Вставить("ИмяРеквизита", "НачалоВыгрузки"); 

	ВводВремениЗавершено(Объект.НачалоВыгрузки, ПараметрыВремени);
КонецПроцедуры
 
&НаКлиенте
Процедура ОкончаниеВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
	ВызовФормыВремени(Объект.ОкончаниеВыгрузки, "ОкончаниеВыгрузки");
КонецПроцедуры
&НаКлиенте
Процедура ОкончаниеВыгрузкиПриИзменении(Элемент)
	ПараметрыВремени = Новый Структура;
	ПараметрыВремени.Вставить("ИмяРеквизита", "ОкончаниеВыгрузки"); 

	ВводВремениЗавершено(Объект.ОкончаниеВыгрузки, ПараметрыВремени);
КонецПроцедуры


&НаКлиенте
Процедура ВремяОстановкиКамерыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
	ВызовФормыВремени(Объект.ВремяОстановкиКамеры, "ВремяОстановкиКамеры");
КонецПроцедуры  
&НаКлиенте
Процедура ВремяОстановкиКамерыПриИзменении(Элемент)
	ПараметрыВремени = Новый Структура;
	ПараметрыВремени.Вставить("ИмяРеквизита", "ВремяОстановкиКамеры"); 

	ВводВремениЗавершено(Объект.ВремяОстановкиКамеры, ПараметрыВремени);
КонецПроцедуры


&НаКлиенте
Процедура ВызовФормыВремени(ДатаВремя, ИмяРеквизита)
	
	ПараметрыВремени = Новый Структура;
	ПараметрыВремени.Вставить("ДатаВремя", ДатаВремя);
	ПараметрыВремени.Вставить("ИмяРеквизита", ИмяРеквизита);

	ОписаниеОповещения = Новый ОписаниеОповещения("ВводВремениЗавершено", ЭтотОбъект, ПараметрыВремени);
	                                                // форма,  				Параметры, Владелец,      Уникальность      Окно НавигационнаяСсылка      
	ОткрытьФорму("Документ.алк_ЗагрузкаВКамеруПропарки.Форма.ФормаВводаВремени", ПараметрыВремени, ЭтаФорма,УникальныйИдентификатор,    , 					, ОписаниеОповещения,);
		
КонецПроцедуры

&НаКлиенте
Процедура ВводВремениЗавершено(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;	
	КонецЕсли; 
	
	РезультатЗакрытия = НачалоМинуты(РезультатЗакрытия);
	
	Если Не ЗначениеЗаполнено(Объект.Сезон) Тогда
		Объект.Сезон = ПолучитьСезон(РезультатЗакрытия); 	
	КонецЕсли; 
	
	Объект.НормативЗагрузки = ПолучитьНормативЗагрузки(РезультатЗакрытия, Объект.Сезон);
	
	Если ДополнительныеПараметры.Свойство("ИмяРеквизита") Тогда  		
		
		Объект[ДополнительныеПараметры.ИмяРеквизита] = РезультатЗакрытия;
				
		Если ДополнительныеПараметры.ИмяРеквизита = "ВремяОстановкиКамеры" Тогда
			
			Если Не ЗначениеЗаполнено(Объект.НачалоВыгрузки) Тогда 		
				Объект.НачалоВыгрузки = Объект.ВремяОстановкиКамеры;	
			КонецЕсли; 
			
			Если Не ЗначениеЗаполнено(Объект.ОкончаниеВыгрузки) Тогда 		
				Объект.ОкончаниеВыгрузки = Объект.НачалоВыгрузки;	
			КонецЕсли;
			
		КонецЕсли;
		
		Если ДополнительныеПараметры.ИмяРеквизита = "НачалоВыгрузки" Тогда
			
			Если Не ЗначениеЗаполнено(Объект.ОкончаниеВыгрузки) Тогда 		
				Объект.ОкончаниеВыгрузки = Объект.НачалоВыгрузки;	
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;        
	
	Модифицированность = Истина;
	
КонецПроцедуры // ВызовФормыВремени()




&НаКлиенте
Процедура НоменклатураГрадацияПропаркиПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Номенклатура.ТекущиеДанные;
	
	ТекущиеДанные.НормативноеВремяПропарки = ПолучитьНормативПропарки(Объект.Дата, Объект.Сезон, ТекущиеДанные.ГрадацияПропарки);	
   
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьСезон(ДатаСреза)
	
	Если Не ЗначениеЗаполнено(ДатаСреза) Тогда
		ДатаСреза = ТекущаяДата();	
	КонецЕсли; 

	Сезон = Перечисления.алк_СезоныПропарки.Лето;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПериодыСезоновПропаркиСрезПоследних.Сезон
		|ИЗ
		|	РегистрСведений.алк_ПериодыСезоновПропарки.СрезПоследних(&ДатаСреза, ) КАК алк_ПериодыСезоновПропаркиСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сезон = ВыборкаДетальныеЗаписи.Сезон;
	КонецЦикла;
	
	Возврат Сезон;

КонецФункции // ПолучитьСезон()

&НаСервереБезКонтекста
Функция ПолучитьНормативЗагрузки(ДатаСреза, Сезон)  
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_НормативыПропаркиСрезПоследних.НормативЗагрузки
		|ИЗ
		|	РегистрСведений.алк_НормативыПропарки.СрезПоследних(&ДатаСреза, ) КАК алк_НормативыПропаркиСрезПоследних
		|ГДЕ
		|	алк_НормативыПропаркиСрезПоследних.Сезон = &Сезон";
	
	Запрос.УстановитьПараметр("ДатаСреза", 	ДатаСреза);
	Запрос.УстановитьПараметр("Сезон", 		Сезон);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Норматив = ВыборкаДетальныеЗаписи.НормативЗагрузки; 
	КонецЦикла;
	
	Возврат Норматив;
    	
КонецФункции // ПолучитьНормативЗагрузки()

&НаСервереБезКонтекста
Функция ПолучитьНормативПропарки(ДатаСреза, Сезон, Градация)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_НормативыПропаркиСрезПоследних.НормативПропарки,
		|	алк_НормативыПропаркиСрезПоследних.НормативЗагрузки
		|ИЗ
		|	РегистрСведений.алк_НормативыПропарки.СрезПоследних(&ДатаСреза, ) КАК алк_НормативыПропаркиСрезПоследних
		|ГДЕ
		|	алк_НормативыПропаркиСрезПоследних.Градация = &Градация
		|	И алк_НормативыПропаркиСрезПоследних.Сезон = &Сезон";
	
	Запрос.УстановитьПараметр("Градация", 	Градация);
	Запрос.УстановитьПараметр("ДатаСреза", 	ДатаСреза);
	Запрос.УстановитьПараметр("Сезон", 		Сезон);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НормативПропарки = ВыборкаДетальныеЗаписи.НормативПропарки;
	КонецЦикла;
	
	Возврат НормативПропарки;

КонецФункции // ПолучитьНормативПропарки()

&НаСервере
Процедура ЗаполнитьПоЗагрузкеНаСервере() 
	
	ДанныеЗаполнения = Объект.ДокументОснование;
	
	// Заполнение шапки
	Объект.КамераПропарки = ДанныеЗаполнения.КамераПропарки;
	Объект.Организация = ДанныеЗаполнения.Организация;
	Объект.Сезон = ДанныеЗаполнения.Сезон;
	Объект.Сертификат = ДанныеЗаполнения.Сертификат;
	Объект.СтруктурнаяЕдиница = ДанныеЗаполнения.СтруктурнаяЕдиница;
	Объект.НормативЗагрузки = ДанныеЗаполнения.НормативЗагрузки;
	
	Если Не ЗначениеЗаполнено(Объект.ВремяОстановкиКамеры) Тогда
		Объект.ВремяОстановкиКамеры = ТекущаяДата();
		Объект.НачалоВыгрузки = Объект.ВремяОстановкиКамеры;
		Объект.ОкончаниеВыгрузки = Объект.НачалоВыгрузки + Объект.НормативЗагрузки * 3600; 			
	КонецЕсли; 
	
	Объект.Номенклатура.Очистить();
	
	Для Каждого ТекСтрокаНоменклатура Из ДанныеЗаполнения.Номенклатура Цикл
		НоваяСтрока = Объект.Номенклатура.Добавить();
		НоваяСтрока.ГрадацияПропарки = ТекСтрокаНоменклатура.ГрадацияПропарки;
		НоваяСтрока.НормативноеВремяПропарки = ТекСтрокаНоменклатура.НормативноеВремяПропарки;
		НоваяСтрока.Объем = ТекСтрокаНоменклатура.Объем;
		НоваяСтрока.Порода = ТекСтрокаНоменклатура.Порода;			
		НоваяСтрока.Сорт = ТекСтрокаНоменклатура.Сорт;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоЗагрузке(Команда)  
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект); 
		
	ПоказатьВопрос(Оповещение,
		"Документ будет перезаполнен, продолжить?",
		РежимДиалогаВопрос.ДаНет,
		0, // таймаут в секундах
		КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
		"Заполнение документа по загрузке" // (необ.) заголовок
		);    

КонецПроцедуры
   
&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
 
    Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьПоЗагрузкеНаСервере(); 		
	КонецЕсли;	
 
КонецПроцедуры

&НаКлиенте
Процедура СменаПриИзменении(Элемент)  

	Объект.Дата = Объект.ДатаСмены + ?(Объект.Смена = ПредопределенноеЗначение("Перечисление.Смены.смена_8_20"), 3600*8, 3600*20); 	
	Объект.ДатаОкончанияСмены = Объект.Дата + (12*3600 - 1);        	
	
КонецПроцедуры

&НаКлиенте
Процедура ДублироватьВремя(Команда)
	
	Объект.НачалоВыгрузки = Объект.ВремяОстановкиКамеры;
	Объект.ОкончаниеВыгрузки = Объект.ВремяОстановкиКамеры;	
	
КонецПроцедуры
